app/controllers/pages_controller.rb

SELECT  "tests".* FROM "tests"  ORDER BY "tests"."id" ASC LIMIT 1
---
  def index
  	@tests = Test.all

SELECT  "tests".* FROM "tests" WHERE "tests"."id" = $1 LIMIT 1  [["id", 1]]
---
  def new
  	@test = Test.find(params[:test_id])

INSERT INTO "answers" ("value", "user_id", "question_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["value", "25"], ["user_id", 1], ["question_id", 1], ["created_at", "2015-02-20 04:00:10.940461"], ["updated_at", "2015-02-20 04:00:10.940461"]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
  def create
  	answers = params[:question]
  	answers.each do |key, value|
  		Question.find(key).answers.build(:value => value, :user_id => User.first.id).save!

SELECT  "tests".* FROM "tests" WHERE "tests"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show_results
    @test = Test.find params[:id]